Revit 2027 API
DGNImportOptions(DGNImportOptions) Constructor
 Constructs a new instance of DGNImportOptions as a copy of the import options.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DGNImportOptions(
	DGNImportOptions option
)
Public Sub New (
	option As DGNImportOptions
)
public:
DGNImportOptions(
	DGNImportOptions^ option
)
new :
        option : DGNImportOptions -> DGNImportOptions
Parameters
option DGNImportOptions
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DGNImportOptions Class
DGNImportOptions Overload
Autodesk.Revit.DB Namespace